/*
 * 求1, ..., n-1 中与n互质的个数
 *
 * E(N)= N*(1-1/f_1)*(1-1/f_2)*(1-1/f_3)....依次类推,
 * 其中f_1, f_2, f_3等是N的不相同的质因子.
 *
 * 例如 12=2*2*3 那么12有两个不同的质因子2, 3,
 * 由欧拉函数可得小于12但与12互质的个数为
 * 12*(1-1/2)(1-1/3)=4,
 * 列举为1, 5, 7, 11.
 */
int euler(int n)
{
    int ans = 1;
    int i;
    for (i=2; i*i<=n; i++) {
        if (n%i == 0) {
            n /= i;
            ans *= i-1;

            while (n%i == 0) {
                n /= i;
                ans *= i;
            }
        }
    }

    if (n > 1) {
        ans *= n-1;
    }

    return ans;
}